
<!-- header -->
```fish
plan -chdir=tf/dev/vpc -lock=false
```
<!-- fmt -->

<!-- outline -->
<details><summary>Outline of changes.</summary>

```diff
+ aws_instance.a4l_bastion will be created
+ aws_instance.a4l_internal will be created
+ aws_key_pair.a4l will be created
+ aws_security_group.bastion will be created
+ aws_security_group.internal will be created
+ aws_security_group_rule.bastion_egress["10.16.160.0/20"] will be created
+ aws_security_group_rule.bastion_egress["10.16.32.0/20"] will be created
+ aws_security_group_rule.bastion_egress["10.16.96.0/20"] will be created
+ aws_security_group_rule.bastion_ingress["192.0.2.1/32"] will be created
+ aws_security_group_rule.internal_egress will be created
+ aws_security_group_rule.internal_ingress will be created
+ module.vpc.aws_db_subnet_group.database[0] will be created
+ module.vpc.aws_default_network_acl.this[0] will be created
+ module.vpc.aws_default_route_table.default[0] will be created
+ module.vpc.aws_default_security_group.this[0] will be created
+ module.vpc.aws_internet_gateway.this[0] will be created
+ module.vpc.aws_route.public_internet_gateway[0] will be created
+ module.vpc.aws_route.public_internet_gateway_ipv6[0] will be created
+ module.vpc.aws_route_table.private[0] will be created
+ module.vpc.aws_route_table.private[1] will be created
+ module.vpc.aws_route_table.private[2] will be created
+ module.vpc.aws_route_table.public[0] will be created
+ module.vpc.aws_route_table_association.database[0] will be created
+ module.vpc.aws_route_table_association.database[1] will be created
+ module.vpc.aws_route_table_association.database[2] will be created
+ module.vpc.aws_route_table_association.private[0] will be created
+ module.vpc.aws_route_table_association.private[1] will be created
+ module.vpc.aws_route_table_association.private[2] will be created
+ module.vpc.aws_route_table_association.public[0] will be created
+ module.vpc.aws_route_table_association.public[1] will be created
+ module.vpc.aws_route_table_association.public[2] will be created
+ module.vpc.aws_subnet.database[0] will be created
+ module.vpc.aws_subnet.database[1] will be created
+ module.vpc.aws_subnet.database[2] will be created
+ module.vpc.aws_subnet.private[0] will be created
+ module.vpc.aws_subnet.private[1] will be created
+ module.vpc.aws_subnet.private[2] will be created
+ module.vpc.aws_subnet.public[0] will be created
+ module.vpc.aws_subnet.public[1] will be created
+ module.vpc.aws_subnet.public[2] will be created
+ module.vpc.aws_vpc.this[0] will be created
```
</details>
<!-- main -->
<details><summary>Plan: 41 to add, 0 to change, 0 to destroy.</br>

###### OpenTofu CI by @chris3ware via [pull_request](https://github.com/3ware/aws-network-speciality/actions/runs/10925598159/job/30327461387) at 2024-09-18T15:43:50Z.
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_instance.a4l_bastion will be created
  + resource "aws_instance" "a4l_bastion" {
      + ami                                  = "ami-033b95fb8079dc481"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "A4L"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "A4L-BASTION"
        }
      + tags_all                             = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "A4L-BASTION"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_instance.a4l_internal will be created
  + resource "aws_instance" "a4l_internal" {
      + ami                                  = "ami-033b95fb8079dc481"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "A4L"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "A4L-INTERNAL-TEST"
        }
      + tags_all                             = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "A4L-INTERNAL-TEST"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_key_pair.a4l will be created
  + resource "aws_key_pair" "a4l" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "A4L"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMNSplDEGibL7tUs87JsuwnHmDA2uSB+M2kUlOQuI0Fc"
      + tags_all        = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
        }
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Security Group for A4L Bastion Host"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "A4L-BASTION"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "A4L-BASTION"
        }
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "A4L-BASTION"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.internal will be created
  + resource "aws_security_group" "internal" {
      + arn                    = (known after apply)
      + description            = "Security Group for A4L internal Host"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "A4L-INTERNAL"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "A4L-INTERNAL"
        }
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "A4L-INTERNAL"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.bastion_egress["10.16.160.0/20"] will be created
  + resource "aws_security_group_rule" "bastion_egress" {
      + cidr_blocks              = [
          + "10.16.160.0/20",
        ]
      + description              = "Outbound traffic private subnets"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # aws_security_group_rule.bastion_egress["10.16.32.0/20"] will be created
  + resource "aws_security_group_rule" "bastion_egress" {
      + cidr_blocks              = [
          + "10.16.32.0/20",
        ]
      + description              = "Outbound traffic private subnets"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # aws_security_group_rule.bastion_egress["10.16.96.0/20"] will be created
  + resource "aws_security_group_rule" "bastion_egress" {
      + cidr_blocks              = [
          + "10.16.96.0/20",
        ]
      + description              = "Outbound traffic private subnets"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # aws_security_group_rule.bastion_ingress["192.0.2.1/32"] will be created
  + resource "aws_security_group_rule" "bastion_ingress" {
      + cidr_blocks              = [
          + "192.0.2.1/32",
        ]
      + description              = "Inbound traffic to bastion hosts"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # aws_security_group_rule.internal_egress will be created
  + resource "aws_security_group_rule" "internal_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Outbound traffic from internal hosts"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.internal_ingress will be created
  + resource "aws_security_group_rule" "internal_ingress" {
      + description              = "Inbound traffic to internal hosts"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for a4l-vpc1"
      + id                      = (known after apply)
      + name                    = "a4l-vpc1"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "a4l-vpc1"
        }
      + tags_all                = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1"
        }
      + vpc_id                  = (known after apply)
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "a4l-vpc1-default"
        }
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "a4l-vpc1-default"
        }
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "a4l-vpc1-default"
        }
      + tags_all               = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "a4l-vpc1"
        }
      + tags_all = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway_ipv6[0] will be created
  + resource "aws_route" "public_internet_gateway_ipv6" {
      + destination_ipv6_cidr_block = "::/0"
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "a4l-vpc1-private-us-east-1a"
        }
      + tags_all         = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-private-us-east-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "a4l-vpc1-private-us-east-1b"
        }
      + tags_all         = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-private-us-east-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "a4l-vpc1-private-us-east-1c"
        }
      + tags_all         = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-private-us-east-1c"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "a4l-vpc1-public"
        }
      + tags_all         = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[2] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.16.0/20"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-db-us-east-1a"
        }
      + tags_all                                       = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-db-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.80.0/20"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-db-us-east-1b"
        }
      + tags_all                                       = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-db-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[2] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.144.0/20"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-db-us-east-1c"
        }
      + tags_all                                       = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-db-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.32.0/20"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-private-us-east-1a"
        }
      + tags_all                                       = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-private-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.96.0/20"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-private-us-east-1b"
        }
      + tags_all                                       = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-private-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.160.0/20"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-private-us-east-1c"
        }
      + tags_all                                       = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-private-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.48.0/20"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-public-us-east-1a"
        }
      + tags_all                                       = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-public-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.112.0/20"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-public-us-east-1b"
        }
      + tags_all                                       = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-public-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.176.0/20"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-public-us-east-1c"
        }
      + tags_all                                       = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1-public-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = true
      + cidr_block                           = "10.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "a4l-vpc1"
        }
      + tags_all                             = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "a4l-vpc1"
        }
    }

Plan: 41 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_hostname = (known after apply)
  + internal_host_ip = (known after apply)

```
</details>
<!-- footer -->
<!-- tofu.48.-chdir-tf-dev-vpc.-out-tfplan -->